"""
Програмування 1. Лабораторна робота №3: "Умовні вирази, робота з математичними функціями"
name group. Варіант 3.
"""
print(
    'Програмування 1. Лабораторна робота №3: "Умовні вирази, робота з математичними функціями"'
)
print("name. Варіант 3.")

# номеру залікової поки немає, тому вказав варіант

from math import *

print('Лабораторна робота №3: "Умовні вирази, робота з математичними функціями"')
print("name", "Варіант 3")

x = float(input("Введіть змінну х:"))
z = float(input("Введіть змінну z:"))

if x == -2 or x == 0 or z == 0:
    print(
        "Значення змінної х (або z) виходить за область визначення функції. Вираз немає розв'язків."
    )
else:
    print((2 * x**2 + x - 5) / (x + 2) + 1 / (tan(x / (2 * z))))
